app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aashish"], ["password_digest", "$2a$10$YJygCDfPs9jGKuHBhw4/wuOkA8saUDaaIYEEEjMFemIgiBs0BpUkS"], ["updated_at", 2017-04-28 20:19:46 UTC], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)